Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །སྡུག་བསྔལ་ཐ་མར་བྱེད་པར་འགྱུར།
en: And bring an end to suffering!”

source: །དེ་ནས་འོད་ཟེར་དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་བྱུལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་རྗེས་བཞིན་དུ་འགྲོའོ།
en: Then the rays of light, after unfurling through the worlds of the great billionfold universe, later return to the Blessed One.

source: །དེ་ལ་གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་འདས་པའི་ལས་ལུང་སྟོན་པར་བཞེད་ན་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྣམ་ལོགས་སུ་ནུབ་པར་འགྱུར་རོ།
en: The rays disappear into the space behind the Blessed One when the Blessed One intends to explain actions of the past.

source: །མ་འོངས་པ་ལུང་སྟོན་པར་བཞེད་ན་ནི་མདུན་ལོགས་སུ་ནུབ་པར་འགྱུར་རོ།
en: They disappear into the space in front of the Blessed One when the Blessed One intends to explain the future.

source: །སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་ལུང་སྟོན་པར་བཞེད་ན་ནི་ཕྱག་གཡོན་པའི་མཐིལ་དུ་ནུབ་པར་འགྱུར། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་ལུང་སྟོན་པར་བཞེད་ན་ནི་ཕྱག་གཡས་པའི་མཐིལ་དུ་ནུབ་པར་འགྱུར།
en: They disappear into his left palm when the Blessed One intends to explain rebirth as a wheel-turning king of power. They disappear into his right palm when the Blessed One intends to explain rebirth as a wheel-turning king.

source: ལྷར་སྐྱེ་བར་ལུང་སྟོན་པར་བཞེད་ན་ནི་ལྟེ་བར་ནུབ་པར་འགྱུར།
en: They disappear into his navel when the Blessed One intends to explain rebirth as a god.

source: ཉན་ཐོས་ཀྱི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་བཞེད་ན་ནི་ཞལ་གྱི་ནང་དུ་ནུབ་པར་འགྱུར།
en: They disappear into his mouth when the Blessed One intends to explain the awakening of a disciple.

source: རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་བཞེད་ན་ནི་མཛོད་སྤུར་ནུབ་པར་འགྱུར།
en: They disappear into the circle of hair between his eyebrows when the Blessed One intends to explain the awakening of a self-awakened one.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་བཞེད་ན་ནི་དབུའི་གཙུག་ཏུ་ནུབ་པར་འགྱུར་རོ།
en: They disappear into the top of his head when the Blessed One intends to explain complete and perfect awakening.

source: །དེ་ནས་འོད་ཟེར་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ།
en: At that time those rays, after circumambulating the Blessed One three times, disappeared into the top of the Blessed One’s head.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཐལ་མོ་སྦྱར་ནས་ཞུས་པ།
en: The venerable Ānanda then made the gesture of supplication to the Blessed One and said:

source: །ཡང་ཚིགས་སུ་བཅད་པ་དག་གིས་གསོལ་ཏོ།
en: Ānanda also spoke these verses:

source: །རྒོད་བྲལ་ཞུམ་དང་རྒྱགས་པ་སྤངས་པ་ཡིས། །སངས་རྒྱས་འགྲོ་ནང་མཆོག་གི་རྒྱུར་གྱུར་པ།
en: “One who has become a buddha, the supreme cause in the world, Free from restlessness, discouragement, and self-satisfaction,

source: །རྒྱལ་བ་དགྲ་ཐུལ་བྱེད་རྒྱུ་མ་མཆིས་པ།
en: A victor who has subdued enemies,

source: །རྩ་ལག་དུང་ལྟར་དཀར་འཛུམ་སྟོན་མི་མཛད།
en: Not without cause does he flash a smile, White like a lotus root or a conch shell.

source: །རྒྱལ་བའི་དབང་པོ་ཐུབ་པ་སྐྱེས་ཀྱི་མཆོག །ཉན་པར་འཚལ་བའི་ཉན་པ་པོ་རྣམས་ཀྱི། །ཐེ་ཙོམ་སྐྱེས་པ་གསུང་ཚིག་བརྟན་པ་དང་། །དམ་པ་བཟང་པོ་དག་གིས་བསལ་དུ་གསོལ།
en: O lord of victors, supreme Muni, And resolve the doubts of your listeners who desire to hear With words that are reliable, sublime, and excellent. “Protectors, perfectly enlightened ones,

source: །ཚྭ་ཆུའི་རི་བོ་ལྟ་བུར་བརྟན་པའི་མཆོག །རྫོགས་སངས་རྒྱས་རྣམས་གློ་བུར་འཛུམ་མི་སྟོན།
en: Who are steady like the mountains in the middle of the ocean, Do not smile accidentally. These many people desire to hear

source: །བརྟན་པ་ཇི་སླད་འཛུམ་པ་སྟོན་མཛད་པ། །སྐྱེ་བོ་ཕལ་ཆེན་འདི་དག་དེ་ཉན་འཚལ།
en: For what reason the resolute one smiles.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: “Ānanda, that is exactly it!” said the Blessed One.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་རྒྱུ་མེད་རྐྱེན་མེད་པར་འཛུམ་པ་མི་མཛད་དོ།
en: Ānanda, tathāgatas, arhats, perfectly awakened ones do not smile without cause, without condition.

source: །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ས་ཕྱོགས་འདི་མཐོང་ངམ། བཙུན་པ་འདི་མཐོང་ལགས་སོ།
en: Ānanda, did you see this place?” “Yes, I did, Honored One.”

source: །ཀུན་དགའ་བོ་ཕྱོགས་འདིར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསུམ་བཞུགས་པར་གྱུར་ཏོ།
en: “Ānanda, three perfectly awakened ones have dwelt in this place.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་མྱུར་བ་མྱུར་བར་བླ་གོས་བཞི་ལྟབ་ཏུ་བྱས་ཏེ་བཏིང་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གདན་བཤམས་པ་ཁོ་ན་ལ་བཞུགས་ཤིག་དང་། ས་ཕྱོགས་འདི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞིས་ཡོངས་སུ་ལོངས་སྤྱད་པར་འགྱུར་ལགས་སོ།
en: The venerable Ānanda then quickly folded his upper robe in four, laid it down, and said to the Blessed One, “Blessed One, please sit on this prepared seat, and then this place will have been enjoyed by four perfectly awakened ones.”

source: །བཅོམ་ལྡན་འདས་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: The Blessed One sat on the prepared seat.

source: །སྐད་ཅིག་གཅིག་བཞུགས་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་གྲོང་ཁྱེར་མི་ཐི་ལ་གང་ན་བར་འདོང་ངོ་།
en: After sitting for a moment, he said to the venerable Ānanda, “Ānanda, let us go to the city of Mithilā.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལུས་འཕགས་ཀྱི་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་མི་ཐི་ལར་བྱོན་ནས།
en: Mithilā Thereupon the Blessed One, traveling through the country of Videha, arrived at Mithilā.

source: མི་ཐི་ལའི་ལྷ་ཆེན་པོའི་ཨ་མྲའི་ཚལ་ན་བཞུགས་སོ།
en: He stayed in the mango grove of Mahādeva in Mithilā.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ས་ཕྱོགས་གཞན་ཞིག་ཏུ་འཛུམ་པ་མཛད་དོ།
en: Then, in a certain place the Blessed One smiled.

source: །ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན་བཙུན་པ་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པ་དེའི་རྒྱུ་གང་ལགས་རྐྱེན་གང་ལགས།
en: The venerable Ānanda saw the Blessed One smile, and having seen that, he said to the Blessed One, “O Honored One, tathāgatas, arhats, perfectly awakened ones do not smile without cause, without condition. What, then, is the cause and condition for the Honored One’s, the Blessed One’s smile?”

source: ཀུན་དགའ་བོ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: “Ānanda, that is exactly it!

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་མེད་རྐྱེན་མེད་པར་འཛུམ་པ་མི་མཛད་དོ།
en: Ānanda, tathāgatas, arhats, perfectly awakened ones do not smile without cause, without condition.

source: །ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་མི་རྣམས་ཀྱི་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པར་གྱུར་ཏེ།
en: Ānanda, once people’s lifespans were eighty thousand years long.

source: མི་ཚེ་ལོ་བརྒྱད་ཁྲི་པ་རྣམས་ཀྱི་འཛམ་བུའི་གླིང་འདི་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ།
en: This continent of Jambu of people whose lifespans were eighty thousand years long was rich, prosperous, peaceful, abundant in food, and full of many people.

source: གྲོང་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་གི་བར་བྱ་གག་གི་འཕུར་སྟབས་ཀྱིས་ཆོད་པ་བྱུང་བར་གྱུར་ཏོ། །མི་ཚེ་ལོ་བརྒྱད་ཁྲི་པ་རྣམས་ལ་ལུས་ཀྱི་གནོད་པ་ནི་འདི་ལྟ་བུ་དག་འབྱུང་སྟེ།
en: Its villages, towns, provinces, and royal palaces were so close that a rooster could fly from one to the next. The people whose lifespans were eighty thousand years long experienced these kinds of physical harm:

source: འདི་ལྟ་སྟེ་གྲང་བ་དང་། ཚ་བ་དང་། བཀྲེས་པ་དང་། སྐོམ་པ་དང་། འདོད་པ་དང་། ཡི་ག་འཆུས་པ་དང་། རྒ་བ་ཡིན་ནོ།
en: cold, heat, hunger, thirst, desire, loss of appetite, and old age.

source: །མི་ཚེ་ལོ་བརྒྱད་ཁྲི་པ་རྣམས་ཀྱི་བུ་མོ་ནི་བཙས་ནས་ལོ་ལྔ་བརྒྱ་ལོན་པ་དང་ཁྱོ་ལ་གཏོང་བར་བྱེད་དེ། དཔེར་ན་ད་ལྟར་གྱི་ལོ་བཅྭ་ལྔའམ་ལོ་བཅུ་དྲུག་ལོན་པ་བཞིན་ནོ།
en: The daughters of the people whose lifespans were eighty thousand years long were given to their grooms at the age of five hundred just as today’s daughters are given at the age of fifteen or sixteen.

source: །ཀུན་དགའ་བོ་མི་རྣམས་ཀྱི་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བ་མཐའ་བཞིར་རྣམ་པར་རྒྱལ་བ་ཆོས་དང་ལྡན་པ་ཆོས་ཀྱི་རྒྱལ་པོ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་།
en: “Ānanda, when people’s lifespans were eighty thousand years long, there appeared a king named Mahādeva, a wheel-turning king who had conquered the border regions in the four directions, a righteous Dharma king who had obtained the seven treasures.

source: །དེའི་རིན་པོ་ཆེ་སྣ་བདུན་ནི་འདི་ལྟ་བུ་དག་བྱུང་སྟེ། འདི་ལྟ་སྟེ།
en: His seven treasures were as follows:

source: འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་ནི་བློན་པོ་རིན་པོ་ཆེ་ཉིད་ཡིན་ནོ། །དེ་ལ་ཡང་བུ་དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་སྟོང་ཡང་ཚང་བར་བྱུང་སྟེ།
en: the precious chakra, elephant, horse, jewel, woman, householder, and minister. He also had a thousand sons who were brave, bold, and endowed with excellent physiques, and who would defeat the enemy’s army.

source: དེ་རྒྱ་མཚོ་ལ་ཐུག་པའི་ས་ཆེན་པོ་མ་ལུས་པ་གནོད་པར་སྡོ་བ་མེད་ཅིང་འཚེ་བ་མེད་པ་འདི་ཉིད་ཆད་པ་མེད་ཅིང་མཚོན་གྱིས་བདའ་བ་མེད་ལ། ཆོས་དང་མཐུན་ཞིང་སྙོམས་པས་ལེགས་པར་ཕབ་སྟེ་གནས་སོ།
en: He conquered the land entirely, as far as the seashore, without risking harm, without violence, without punishment or weapons, but in accord with the Dharma and impartially.

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་སྐྲ་དང་ཁ་སྤུ་འབྲེག་མཁན་གྱི་མིས་སྐྲ་དང་ཁ་སྤུ་འཆོས་པ་ན་འབྲེག་མཁན་གྱི་མི་ལ་སྨྲས་པ།
en: “Then, when the barber who used to cut King Mahādeva’s hair and beard was arranging the king’s hair and beard, the king gave him an order:

source: ཀྱེ་ནང་རྗེ་ངའི་དབུ་ལ་སྐྲ་དཀར་པོ་སྐྱེས་པ་ཁྱོད་ཀྱིས་མཐོང་དང་ལྷའི་ཕོ་ཉ་བྱུང་བ་ཡིན་གྱིས་དེའི་ཚེ་ངའི་སྙན་དུ་གསོལ་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་འབྲེག་མཁན་གྱི་མིས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་ལྟར་མཉན་ཏོ།
en: ‘When you find a white hair growing on my head, tell me, for it is a divine messenger.’ “ ‘Certainly, Your Majesty,’ replied the barber to King Mahādeva.

source: །དུས་གཞན་ཞིག་ན་འབྲེག་མཁན་གྱིས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་སྐྲ་དང་ཁ་སྤུ་འཆོས་པ་ན་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་མགོ་ལ་སྐྲ་དཀར་པོ་སྐྱེས་པས་ལྷའི་ཕོ་ཉ་བྱུང་བར་མཐོང་ངོ་།
en: “Then one day the barber, arranging King Mahādeva’s hair and beard, did find white hairs growing on King Mahādeva’s head and he realized that a divine messenger had appeared.

source: །མཐོང་ནས་ཀྱང་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། ཁྱོད་ཀྱི་དབུ་ལ་དབུ་སྐྲ་དཀར་པོ་སྐྱེས་པས་ལྷའི་ཕོ་ཉ་བྱུང་ལགས་སོ། །དེས་སྨྲས་པ།
en: Having found them, he said to King Mahādeva, ‘Your Majesty, please be informed that white hairs are growing on your head and thus a divine messenger has appeared.’

source: ཀྱེ་ནང་རྗེ་ཁྱོད་ཀྱིས་སྐྲ་དཀར་པོ་དེ་དག་མི་བྲེག་པར་དལ་བུ་དལ་བུས་ཕྱུང་ལ་ངའི་ལག་ཏུ་བྱིན་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་འབྲེག་མཁན་གྱིས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་ལྟར་མཉན་ནས་སྐྲ་དཀར་པོ་དེ་གསེར་གྱི་སྨང་ཚེར་གྱིས་མི་དྲག་པར་དལ་གྱིས་དལ་གྱིས་ཕྱུང་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་ལག་པར་བཞག་གོ།
en: “The king gave him another order: ‘Gently pull those white hairs out without cutting them, and place them in my palm.’ “ ‘Certainly, Your Majesty,’ replied the barber to King Mahādeva, and he gently pulled the white hairs out with a pair of golden tweezers, without cutting them, and placed them in King Mahādeva’s palm.

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་སྐྲ་དཀར་པོ་དེ་ལག་པ་གཉིས་ཀྱིས་དྲངས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then King Mahādeva, holding the white hairs in both his hands, spoke a verse:

source: ད་ནི་བདག་གི་མགོ་བོ་ལ།
en: “ ‘Now there grow on my head

source: །ན་ཚོད་འཇོམས་པའི་སྐྲ་སྐྱེས་ཏེ།
en: Hairs that plunder youth.

source: །ལྷ་ཡི་ཕོ་ཉ་བྱུང་གྱུར་པས།
en: Since the divine messenger has appeared,

source: །བདག་གི་རབ་བྱུང་དུས་ལ་བབ།
en: It is time for me to go forth.

source: །བདག་གིས་མི་རྣམས་ཀྱི་འདོད་པ་ནི་སྤྱད་ཟིན་གྱིས་བདག་གིས་ལྷའི་འདོད་པ་དག་བཙལ་བའི་དུས་ལ་བབ་ཀྱིས།
en: “ ‘Since I have already enjoyed human desires, it is time for me to seek divine desires.

source: མ་ལ་བདག་གིས་གཞོན་ནུ་ཐུ་བོ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་བཅུག་ལ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱད་དོ་སྙམ་ནས།
en: Now I will put my eldest son upon the throne and lead the pure life of a royal ṛṣi.’

source: དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་གཞོན་ནུ་ཕོ་ཉས་བཀུག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་གཞོན་ནུ་ཤེས་པར་གྱིས་ཤིག ། ངའི་མགོ་ལ་སྐྲ་དཀར་པོ་སྐྱེས་པས་ལྷའི་ཕོ་ཉ་བྱུང་བར་གྱུར་ཏེ།
en: “Thereupon King Mahādeva summoned his son by messenger and said, ‘Understand, my son, that white hairs are growing on my head and thus a divine messenger has appeared.

source: ངས་མི་རྣམས་ཀྱི་འདོད་པ་ནི་སྤྱད་ཟིན་པས་ངས་ལྷའི་འདོད་པ་དག་བཙལ་བའི་དུས་ལ་བབ་སྟེ།
en: Since I have enjoyed human desires, it is time for me to seek divine desires. I will now put you upon the throne and lead the pure life of a royal ṛṣi.

source: ངས་བུ་གཞོན་ནུ་ཁྱོད་ལ་རྒྱ་མཚོའི་མཐས་ཀླས་པའི་ས་ཆེན་པོ་འདི་གཏད་ཀྱིས་དེ་ཁྱོད་ཀྱིས་ཆོས་བཞིན་གྱིས་རྗེས་སུ་བསྐྱང་བར་བྱའི་ཆོས་མ་ཡིན་པས་ནི་མ་ཡིན་ནོ།
en: My son, I will entrust you with the land as far as the seashore, so you should protect it lawfully, not unlawfully.

source: །འགའ་ཞིག་ཆོས་མ་ཡིན་པ་སྤྱོད་དམ་འདྲེན་མར་སྤྱོད་ན་ཁྱོད་ཀྱིས་ཡུལ་འཁོར་དུ་གནས་སུ་མ་གཞུག་ཤིག །བུ་གཞོན་ནུ་གང་གི་ཚེ་ཁྱོད་ཀྱང་མགོ་ལ་སྐྲ་དཀར་པོ་སྐྱེས་པ་མཐོང་བ་དང་ལྷའི་ཕོ་ཉ་འོངས་པ་ཡིན་གྱིས།
en: If someone’s conduct is unlawful or a mixture of lawful and unlawful, do not let him live in your country. “ ‘My son, when you too find a white hair growing on your head and a divine messenger has thus appeared, you should put your eldest son upon the throne and lead the pure life of a royal ṛṣi, too.

source: དེའི་ཚེ་ཁྱོད་ཀྱིས་ཀྱང་གཞོན་ནུ་ཐུ་བོ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་ཆུག་ལ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག །འདི་ལྟར་བུ་གཞོན་ནུ་ཁྱོད་ཀྱི་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་དོད་པ་དེ་ལྟ་བུའི་རྗེས་བསབ་པར་བྱའི་རྒྱུན་ཆད་པར་མ་བྱེད་ཅིག །སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་ཏ་རེ།
en: Thus, my son, you should complete this virtuous and sure path introduced by me and you should not break the tradition. Do not be an inferi or man.

source: བུ་གཞོན་ནུ་འགའ་ཞིག་འདི་ལྟ་བུའི་སྐྱེས་བུ་བཟང་པོ་རྒྱུད་དུ་བྱུང་བའི་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་དོད་པ་དེ་ལྟ་བུའི་རྗེས་མི་འཚོབ་པ་གང་ཡིན་པ་དེ་དེ་རྣམས་ཀྱི་རྒྱུན་གཅོད་པ་ཡིན་ཞིང་དེ་དེ་རྣམས་ཀྱི་ནང་ན་སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པ་ཡིན་ནོ། །དེ་ལྟ་བས་ན་ད་ཁྱོད་ལ་འདི་སྐད་ཅེས།
en: “ ‘My son, he who does not allow such a virtuous and sure path of good men born to a noble lineage to increase, once introduced, will be the one who breaks their tradition and be an inferior man among them.

source: གང་གི་ཚེ་ཁྱོད་ཀྱིས་འདི་ལྟ་བུའི་སྐྱེས་བུ་བཟང་པོ་རྒྱུད་དུ་བྱུང་བའི་དགེ་བའི་ལམ་ངེས་པ་སྲོལ་དོད་པ་དེ་ལྟ་བུའི་རྗེས་སོབས་ལ་རྒྱུན་ཆད་པར་མ་བྱེད་ཅིག །སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པར་མ་བྱེད་ཅིག་ཅེས་སྨྲའོ།
en: Therefore, I now said, “Complete such a virtuous and sure path of good men born to a noble lineage introduced by me. You should not break the tradition. Do not be an inferior man.” ’

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་གཞོན་ནུ་ཐུ་བོ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་བཅུག་ནས་མི་ཐི་ལའི་ལྷ་ཆེན་པོའི་ཨ་མྲའི་ཚལ་དེ་ཉིད་དུ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ།
en: “Thereupon King Mahādeva put his eldest son upon the throne and led the pure life of a royal ṛṣi in the mango grove of Mahādeva in Mithilā.

source: །ཀུན་དགའ་བོ་རྒྱལ་པོ་ལྷ་ཆེན་པོས་གཞོན་ནུ་ཐུ་བོ་གང་ཡིན་པ་དེ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་བཅུག་པ་དེའི་མིང་ཡང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བ་མཐའ་བཞིར་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་ནས་གནས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོའི་སྐྲ་དང་ཁ་སྤུ་འབྲེག་མཁན་གྱི་མིས་སྐྲ་དང་ཁ་སྤུ་འཆོས་པ་ན་ཞེས་བྱ་བ་ནས། དེ་དེ་རྣམས་ཀྱི་ནང་ན་སྐྱེས་བུ་ཐ་ཤལ་དུ་གྱུར་པ་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Ānanda, the eldest son whom King Mahādeva put upon the throne was also named Mahādeva, a wheel-turning king who had conquered the border regions in the four directions . . . . Then, when the barber who used to cut King Mahādeva’s hair and beard was arranging . . . .

source: །དེ་ནས་རྒྱལ་པོ་ལྷ་ཆེན་པོས་གཞོན་ནུ་ཐུ་བོ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་དུ་བཅུག་ནས་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ།
en: ‘Do not be an inferior man.’ Thereupon King Mahādeva put his eldest son upon the throne and led the pure life of a royal ṛṣi in the mango grove of Mahādeva in Mithilā.

source: །ཀུན་དགའ་བོ་བུ་དང་། ཚ་བོ་དང་། ཡང་ཚ་དང་། སུམ་ཚ་ལ་སོགས་པ་དེ་ལྟར་བརྒྱུད་པས་ལྷ་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་མི་ཐི་ལའི་ལྷ་ཆེན་པོའི་ཨ་མྲའི་ཚལ་འདི་ཉིད་དུ་རྒྱལ་པོའི་དྲང་སྲོང་གི་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ།
en: “Ānanda, his son, grandson, great-grandson, great-great-grandson, and so on, followed likewise, and eighty-four thousand Mahādevas led the pure life of a royal ṛṣi in this very mango grove of Mahādeva in Mithilā.

source: །དེ་རྣམས་ཀྱི་ཐ་མ་རྒྱལ་པོ་མུ་ཁྱུད་ཅེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཆོས་ལ་གནས་པའི་རྒྱལ་པོ་ཆེན་པོ་ཞིག་བྱུང་སྟེ།
en: “The last of the line was a king named Nimi, a righteous Dharma king, a great king who abided in the Dharma.

source: དེ་བཙུན་མོ་དང་། གཞོན་ནུ་དང་། བློན་པོ་དང་། ཁྲོམ་གྱི་རུ་པ་དང་། གྲོང་མི་དང་། ཡུལ་མི་དག་དང་ཆོས་སྤྱོད་དེ་སྦྱིན་པ་དག་གཏོང་། བསོད་ནམས་དག་བྱེད་ཅིང་བསྙེན་གནས་ལ་གནས་ཏེ་ཚུལ་ཁྲིམས་ཡང་དག་པར་བླངས་ནས་འདུག་གོ།
en: With his consort, sons, ministers, army, citizens, and provincial dwellers, he practiced the Dharma, gave donations, made merit, abided in abstinence, and practiced moral conduct correctly.

source: །དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལྷའི་འདུན་ས་ཆོས་བཟང་དུ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་འདུས་ཤིང་འཁོད་པ་རྣམས་ཀྱི་མདུན་དུ་བསྔགས་པ་རྗོད་པར་བྱེད་དེ། གྲོགས་པོ་དག་ལུས་འཕགས་ཀྱི་མི་རྣམས་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་དེ།
en: “At that time, Śakra, Lord of the Gods, praised the king in the presence of the Thirty-Three Gods, who were sitting together in the divine meeting hall Sudharmā:

source: ལུས་འཕགས་ཀྱི་མི་དེ་རྣམས་ཀྱི་རྒྱལ་པོ་མུ་ཁྱུད་ནི་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཆོས་ལ་གནས་པའི་རྒྱལ་པོ་ཆེན་པོ་དེ་བཙུན་མོ་དང་ཞེས་བྱ་བ་ནས་ཚུལ་ཁྲིམས་ཡང་དག་པར་བླངས་ཏེ་འདུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: ‘O my friends, the people of Videha have attained a great boon, for Nimi, the king of the people of Videha, is a righteous Dharma king, a great king who abides in the Dharma. He, with his consort . . . practices moral conduct correctly.

source: །གྲོགས་པོ་དག་ཁྱེད་ཅག་རྒྱལ་པོ་མུ་ཁྱུད་ལྟ་བར་འདོད་དམ།
en: O my friends, do you want to see King Nimi?’

source: ཀཽ་ཤི་ཀ་ཤིན་ཏུ་འཚལ་ལོ།
en: “ ‘O Kauśika, we sincerely wish to do so.’

source: །གྲོགས་པོ་དག་དེའི་ཕྱིར་ཁྱེད་ཅག་སྡོད་ཅིག་དང་ཁོ་བོས་རེ་ཞིག་རྒྱལ་པོ་མུ་ཁྱུད་བལྟའོ།
en: “ ‘Then, my friends, you wait here. I will see King Nimi briefly.’

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དཔེར་ན་སྐྱེས་བུ་སྟོབས་དང་ལྡན་པའི་ལག་པ་བསྐུམ་པ་ལས་བརྐྱང་བའམ། བརྐྱང་བ་ལས་བསྐུམ་པ་ཙམ་གྱིས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ལྷའི་འདུན་ས་ཆོས་བཟང་ནས་མི་སྣང་བར་གྱུར་ཏེ། མི་ཐི་ལར་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱི་ཁང་བཟངས་སུ་འདུག་གོ། །འདི་སྐད་ཅེས་ཀྱང་སྨྲས་ཏེ།
en: “Thereupon Śakra, Lord of the Gods, disappeared from the Thirty-Three Gods’ divine meeting hall Sudharmā, as quickly as a strong man stretches his bent arm or bends his stretched arm, and sat in King Nimi’s palace in Mithilā.

source: མུ་ཁྱུད་ཁྱོད་ལ་ལྷའི་འདུན་ས་ཆོས་བཟང་དུ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་འདུས་ཤིང་འདུག་པ་རྣམས་བསྔགས་པ་རྗོད་པ་ནི་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ།
en: He said, ‘O Nimi, you have attained a great boon, for the Thirty-Three Gods, sitting together in the divine meeting hall Sudharmā, have praised you: “O my friends, the people of Videha . . . .

source: །གྲོགས་པོ་ལུས་འཕགས་ཀྱི་མི་རྣམས་ཀྱིས་རྙེད་པ་ཞེས་བྱ་བ་ནས་ཚུལ་ཁྲིམས་ཡང་དག་པར་བླངས་ཏེ་འདུག་པར་བྱེད་དོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །མུ་ཁྱུད་ཁྱོད་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་བལྟ་བའི་ཕྱིར་འགྲོ་འདོད་དམ།
en: He . . . practices moral conduct correctly.” O Nimi, do you want to go see the Thirty-Three Gods?’

source: ཀཽ་ཤི་ཀ་བདག་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་བལྟ་བའི་ཕྱིར་མཆི་བར་འཚལ་ལོ།
en: “ ‘O Kauśika, I do wish to go see the Thirty-Three Gods.’ “ ‘Then, Nimi, wait here.

source: །མུ་ཁྱུད་དེའི་ཕྱིར་སྡོད་ཅིག་དང་རེ་ཞིག་ཁོ་བོས་ཁྱོད་ལ་རྟ་ཅང་ཤེས་སྟོང་དང་ལྡན་པའི་ཤིང་རྟ་བསྐུར་གྱིས་དེའི་ནང་དུ་ཁྱོད་ཞུགས་ལ་མ་གཡོ་བར་ཤོག་ཤིག །དེ་བཞིན་དུ་བགྱིའོ་ཞེས་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ལྟར་མཉན་ཏོ།
en: I will shortly send you a chariot drawn by a thousand fine horses. You should ride in it and come without fear.’ “ ‘I shall do so,’ replied King Nimi to Śakra, Lord of the Gods.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སོང་ནས་ཁ་ལོ་སྒྱུར་བ་མ་ལ་གདུ་ལ་སྨྲས་པ། མ་ལ་གདུ་ཁྱོད་སོང་ལ་མྱུར་བ་ཁོ་ནར་རྟ་ཅང་ཤེས་སྟོང་དང་ལྡན་པའི་ཤིང་རྟ་ཤོམས་ཏེ་རྒྱལ་པོ་མུ་ཁྱུད་གང་ན་བ་དེར་སོང་ལ་ཕྱིན་ནས་འདི་སྐད་ཅེས།
en: “Thereupon Śakra, Lord of the Gods, went to the Thirty-Three Gods and ordered Mātali, the charioteer, ‘Mātali, go and very quickly prepare a chariot with a thousand fine horses.

source: མུ་ཁྱུད་ཁྱོད་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རྟ་ཅང་ཤེས་སྟོང་དང་ལྡན་པའི་ཤིང་རྟ་བསྐུར་བ་འདི་ཡིན་གྱིས།
en: Go to King Nimi and say, “O Nimi, this is the chariot drawn by a thousand fine horses sent to you by Śakra, Lord of the Gods.

source: འདིར་ཁྱོད་ཞུགས་ལ་མ་གཡོ་བར་ཤོག་ཤིག་ཅེས་སྨྲོས་ཤིག །ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་གསུངས་པ་ཤིན་ཏུ་བཟང་ངོ་ཞེས་ཁ་ལོ་སྒྱུར་བ་མ་ལ་གདུས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ལྟར་མཉན་ནས་མྱུར་བ་ཁོ་ནར་རྟ་ཅང་ཤེས་སྟོང་དང་ལྡན་པའི་ཤིང་རྟ་བཤམས་ནས་རྒྱལ་པོ་མུ་ཁྱུད་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Ride in it and come without fear.” ’ “ ‘O Kauśika, what you said is excellent,’ replied the charioteer Mātali to Śakra, Lord of the Gods. He very quickly prepared a chariot with a thousand fine horses and went to King Nimi.

source: །མུ་ཁྱུད་ཁྱོད་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རྟ་ཅང་ཤེས་སྟོང་དང་ལྡན་པའི་ཤིང་རྟ་བསྐུར་བ་འདི་ཡིན་གྱིས།
en: Upon his arrival, he said, ‘O Nimi, this is the chariot drawn by a thousand fine horses sent to you by Śakra, Lord of the Gods.

source: འདིར་ཁྱོད་ཞུགས་ལ་མ་གཡོ་བར་ཤོག་ཤིག་ཅེས་ཟེར་རོ།
en: Ride in it and come without fear.’

source: །ཀུན་དགའ་བོ་རྒྱལ་པོ་མུ་ཁྱུད་རྟ་ཅང་ཤེས་སྟོང་དང་ལྡན་པའི་ཤིང་རྟའི་ནང་དུ་མི་གཡོ་བར་ཞུགས་པ་དང་། དེ་ནས་ཁ་ལོ་སྒྱུར་བ་མ་ལ་གདུས་རྒྱལ་པོ་མུ་ཁྱུད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Ānanda, King Nimi did ride the chariot drawn by a thousand fine horses without fear.

source: །མུ་ཁྱུད་ཁྱོད་ཀྱི་ཤིང་རྟ་གང་ལོགས་སུ་དྲང་། གང་ན་སེམས་ཅན་སྡིག་པའི་ལས་ཅན་རྣམས་སྡིག་པ་མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་སོ་སོར་ཉམས་སུ་མྱོང་བ་ལོགས་སུའམ། གང་ན་སེམས་ཅན་དགེ་བའི་ལས་ཅན་རྣམས་ལས་དགེ་བའི་རྣམ་པར་སྨིན་པ་སོ་སོར་ཉམས་སུ་མྱོང་བ་ལོགས་སུ་དྲང་།
en: Then the charioteer Mātali asked King Nimi, ‘O Nimi, along which side shall I drive your chariot, the side where beings of evil actions experience the maturation of evil and nonvirtuous actions, or the side where beings of virtuous actions experience the maturation of virtuous actions?’

source: མ་ལ་གདུ་དེའི་ཕྱིར་ཁོ་བོས་གང་དུ་གཉི་ག་མཐོང་བར་འགྱུར་བ་གང་ན་སེམས་ཅན་སྡིག་པའི་ལས་ཅན་རྣམས་སྡིག་པ་མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་སོ་སོར་ཉམས་སུ་མྱོང་བ་དག་ཡོད་པ་དང་། གང་ན་སེམས་ཅན་དགེ་བའི་ལས་ཅན་རྣམས་ལས་དགེ་བའི་རྣམ་པར་སྨིན་པ་སོ་སོར་ཉམས་སུ་མྱོང་བ་དག་ཡོད་པ་དེར་ཤིང་རྟ་དྲོངས་ཤིག །དེ་ནས་ཁ་ལོ་སྒྱུར་བ་མ་ལ་གདུས་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱི་ཤིང་རྟ་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་གང་ན་སེམས་ཅན་སྡིག་པའི་ལས་ཅན་རྣམས་སྡིག་པ་མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་སོ་སོར་ཉམས་སུ་མྱོང་བ་དག་ཡོད་པ་དང་། གང་ན་སེམས་ཅན་དགེ་བའི་ལས་ཅན་རྣམས་ལས་དགེ་བའི་རྣམ་པར་སྨིན་པ་སོ་སོར་ཉམས་སུ་མྱོང་བ་དག་ཡོད་པ་གཉི་ག་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་ཇི་ལྟར་མཐོང་བར་འགྱུར་བ་དེ་ལྟར་དྲངས་སོ།
en: “ ‘In this case, Mātali, drive the chariot in a way that will enable me to see both, the side where beings of evil actions experience the maturation of evil and nonvirtuous actions and the side where beings of virtuous actions experience the maturation of virtuous actions.’ “Thereupon the charioteer Mātali drove King Nimi’s chariot in a way that enabled King Nimi to see both, the side where beings of evil actions experience the maturation of evil and nonvirtuous actions and the side where beings of virtuous actions experience the maturation of virtuous actions.

source: །ཀུན་དགའ་བོ་རྒྱལ་པོ་མུ་ཁྱུད་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སོང་ནས་རྒྱལ་པོ་མུ་ཁྱུད་ལྷའི་འདུན་ས་ཆོས་བཟང་དུ་ཞུགས་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རྒྱལ་པོ་མུ་ཁྱུད་ལ་སྟན་ཕྱེད་བསྟབས་ནས་རྒྱལ་པོ་མུ་ཁྱུད་དང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སྟན་ཕྱེད་ཕྱེད་ལ་འཁོད་དོ།
en: “Ānanda, King Nimi went to the Thirty-Three Gods and sat in the Thirty-Three Gods’ divine meeting hall Sudharmā. Śakra, Lord of the Gods, offered half of his seat to King Nimi. King Nimi and Śakra, Lord of the Gods, sat on the two halves of the same seat.
